{
  "backend/main.mo": "Motoko canister providing CRUD operations for products, reps, consignments, sales, returns, and payouts using Map-based storage with incremental IDs.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to frontend files, components, requirements, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing one-line summaries for all major frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base and theme definitions using OKLCH variables for light/dark modes, including print styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all entity routes and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/AppLayout.tsx": "Layout component with header, navigation tabs, main container, and footer for consistent UI structure.",
  "frontend/src/components/CommissionSettingsDialog.tsx": "Dialog for editing default and per-rep commission rates with validation and persistence.",
  "frontend/src/components/DateRangeFilter.tsx": "Provides a popover-based UI for selecting and clearing start/end dates using date inputs.",
  "frontend/src/components/LineItemsEditor.tsx": "Renders a list editor for product line items with add, update, and remove capabilities, optionally including unit price fields.",
  "frontend/src/components/ProductSelect.tsx": "Dropdown selector that loads products via useProducts and displays names with formatted prices.",
  "frontend/src/components/RepSelect.tsx": "Dropdown selector that loads reps via useReps and displays their names.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for loading and mutating products, reps, consignments, sales, and returns using the backend actor.",
  "frontend/src/index.css": "Tailwind base setup defining light/dark theme CSS variables and print styles.",
  "frontend/src/lib/calculations.ts": "Computes rep financial balances and inventory quantities from sales, returns, payouts, and consignments with optional date filtering.",
  "frontend/src/lib/commissionSettings.ts": "Loads, saves, and updates commission settings including default and per-rep overrides using localStorage.",
  "frontend/src/lib/csv.ts": "Generates CSV strings, triggers downloads, and formats dates and currency values.",
  "frontend/src/lib/dateUtils.ts": "Provides helpers for month boundaries, formatting month/year, and retrieving the current month.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ConsignmentsPage.tsx": "UI for listing, filtering, exporting, and adding consignments with date range filtering.",
  "frontend/src/pages/DashboardPage.tsx": "Displays rep balances and inventory summaries with CSV export and commission settings access.",
  "frontend/src/pages/PayoutsPage.tsx": "Manages payout records including creation, filtering, and CSV export.",
  "frontend/src/pages/ProductsPage.tsx": "Lists, searches, exports, and adds products with basic validation.",
  "frontend/src/pages/RepsPage.tsx": "UI page for listing, searching, exporting, and adding reps with a dialog form and CSV export.",
  "frontend/src/pages/ReturnsPage.tsx": "Page to record returns with rep/product selection, date filtering, CSV export, and a modal for adding line-item returns.",
  "frontend/src/pages/SalesPage.tsx": "Sales entry page supporting rep selection, line-item sales creation, date filtering, and CSV export.",
  "frontend/src/pages/StatementsPage.tsx": "Generates monthly statements for reps with filters for rep and period, showing sales, returns, payouts, and balances with print support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme settings, colors, animations, and plugin usage.",
  "project_state.json": "Metadata describing project state, features, requirements, and architectural notes for ConsignFlow."
}