{
  "backend/main.mo": "Motoko canister defining data models and CRUD APIs for products, reps, consignments, sales, returns, payouts, adjustments, and settlement periods with ID counters and settlement locking.",
  "backend/migration.mo": "Migration module that upgrades old state by adding empty adjustments and settlements maps and initializing new ID counters.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs associated with recent settlement-period and adjustment-related features.",
  "frontend-file-summaries.txt": "Contains short descriptions of each frontend file, summarizing components, pages, utilities, and hooks.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme color tokens using OKLCH and applying global background/foreground styling.",
  "frontend/index.html": "HTML entry point loading the root element and bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration wiring all pages, including settlement periods and adjustments, wrapped with theme provider and toaster.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, navigation tabs, main content area, and footer for the app.",
  "frontend/src/components/CommissionSettingsDialog.tsx": "Dialog for viewing and editing default commission rates and per-rep overrides with validation and persistence.",
  "frontend/src/components/DateRangeFilter.tsx": "Popover-based date range selector allowing users to pick, clear, and apply start/end dates.",
  "frontend/src/components/LineItemsEditor.tsx": "Editor for managing line items including product selection, quantity, and optional unit price fields.",
  "frontend/src/components/ProductSelect.tsx": "Dropdown that loads and displays products for selection, showing names and formatted prices.",
  "frontend/src/components/RepSelect.tsx": "Dropdown that loads and displays reps for selection by name.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating products, reps, consignments, sales, returns, and related data from the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind styles, CSS variables for themes, and print-specific formatting rules.",
  "frontend/src/lib/calculations.ts": "Implements functions to compute rep balances and inventory levels using sales, returns, payouts, consignments, and product data.",
  "frontend/src/lib/commissionSettings.ts": "Manages commission settings with localStorage, including defaults and per‑rep overrides.",
  "frontend/src/lib/csv.ts": "Provides CSV generation, downloading utilities, and helpers for formatting dates and currency.",
  "frontend/src/lib/dateUtils.ts": "Offers utilities for month boundaries, formatting month-year strings, and retrieving the current month.",
  "frontend/src/lib/settlementLock.ts": "Checks whether a date falls within a closed settlement period and formats settlement period dates.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdjustmentsPage.tsx": "UI page for listing and creating rep adjustments with validation, dialogs, and form submission.",
  "frontend/src/pages/ConsignmentsPage.tsx": "UI page for viewing, filtering, exporting, and adding consignments with settlement lock checks and multi‑item entry.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard displaying rep balances and inventory with date filters, CSV export, and commission settings dialog.",
  "frontend/src/pages/PayoutsPage.tsx": "Page to record, filter, and export rep payouts with validation, settlement lock checks, and add‑payout dialog.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page allowing search, creation, listing, and CSV export of products.",
  "frontend/src/pages/RepsPage.tsx": "Page for managing sales reps with search, rep creation dialog, and CSV export including commission data.",
  "frontend/src/pages/ReturnsPage.tsx": "Page for logging and exporting rep product returns with line‑item editing, filters, and settlement lock enforcement.",
  "frontend/src/pages/SalesPage.tsx": "Sales management page that lists sales, filters by date, adds new sales with line items, and exports filtered data to CSV while enforcing settlement-period locks.",
  "frontend/src/pages/SettlementPeriodsPage.tsx": "UI for creating and closing settlement periods with date validation, listing periods, and locking transactions for closed ranges.",
  "frontend/src/pages/StatementsPage.tsx": "Generates monthly printable statements for reps by selecting rep and date range and computing balances, commissions, and related transactions.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, container settings, and plugins for layout and styling.",
  "project_state.json": "JSON snapshot describing project version, features, architecture notes, and planned enhancements for the ConsignFlow application."
}