{
  "backend/main.mo": "Main backend actor defining data models (Product, Rep, Consignment, Sale, ReturnModel, Payout, SettlementPeriod, Adjustment) with CRUD operations, settlement period management with lock enforcement, and balance calculations for consignment tracking.",
  "feature_evidence.json": "Feature evidence report documenting implementation of backend data models and persistent storage for products, reps, consignments, sales, returns, and payouts with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, utilities, and configuration covering the complete consignment management application with settlement periods and adjustments.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system using charcoal and green accent palette for light and dark themes, plus CSS custom properties for UI components.",
  "frontend/index.html": "HTML entry point for the ConsignFlow application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (dashboard, products, reps, consignments, sales, returns, payouts, statements, settlement periods, adjustments) wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AppLayout.tsx": "Main layout component with header, navigation tabs for all pages with icons, main content area, and footer with Caffeine.ai attribution and UTM tracking.",
  "frontend/src/components/CommissionSettingsDialog.tsx": "Dialog component for configuring default commission rate and per-rep overrides with validation, saving to commission settings utility.",
  "frontend/src/components/DateRangeFilter.tsx": "A popover component that provides start and end date inputs for filtering data by date range, with clear and apply actions.",
  "frontend/src/components/LineItemsEditor.tsx": "An editor component for managing a list of line items with product selection, quantity, and optional unit price fields, supporting add and remove operations.",
  "frontend/src/components/ProductSelect.tsx": "A select dropdown component that fetches and displays products from the backend, showing product name and price.",
  "frontend/src/components/RepSelect.tsx": "A select dropdown component that fetches and displays sales representatives from the backend.",
  "frontend/src/hooks/useActor.ts": "A React hook that manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing login state, identity, and authentication lifecycle using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including products, reps, consignments, sales, returns, payouts, adjustments, and settlement periods.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, CSS custom properties for theming (light/dark modes), and print-specific styles for statement rendering.",
  "frontend/src/lib/calculations.ts": "Provides functions to calculate rep balances (sales, returns, payouts, commission, amount owed) and inventory by rep, with optional date filtering and commission rate overrides.",
  "frontend/src/lib/commissionSettings.ts": "Manages commission settings stored in localStorage, including default commission percentage and per-rep overrides, with functions to get, save, and update settings.",
  "frontend/src/lib/csv.ts": "Utility functions for generating CSV files from data arrays, downloading CSV files to the browser, and formatting dates and currency values.",
  "frontend/src/lib/dateUtils.ts": "Helper functions for working with month boundaries, formatting month/year strings, and getting the current month.",
  "frontend/src/lib/settlementLock.ts": "Checks if a given date falls within a closed settlement period and provides formatted error messages to prevent editing locked transactions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdjustmentsPage.tsx": "Page for viewing and adding financial adjustments to rep accounts, with form validation, date selection, and a sortable table of existing adjustments.",
  "frontend/src/pages/ConsignmentsPage.tsx": "Page for managing consignments with multi-line item entry, date range filtering, CSV export, and settlement period lock validation to prevent editing closed periods.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying rep balances and inventory in tabbed views, with date range filtering, CSV export, and commission settings configuration.",
  "frontend/src/pages/PayoutsPage.tsx": "Displays and manages commission payouts to sales reps with date filtering, CSV export, and settlement period locking. Allows adding new payouts with rep selection, amount, date, and notes.",
  "frontend/src/pages/ProductsPage.tsx": "Manages product catalog with search functionality and CSV export. Provides a dialog to add new products with name and price fields.",
  "frontend/src/pages/RepsPage.tsx": "Manages sales representatives with search and CSV export including commission rates. Provides a dialog to add new reps by name.",
  "frontend/src/pages/ReturnsPage.tsx": "Tracks product returns from reps with date filtering, CSV export, and settlement period locking. Supports multi-line item returns with rep, product, quantity, and date selection.",
  "frontend/src/pages/SalesPage.tsx": "Records sales transactions with date filtering, CSV export, and settlement period locking. Supports multi-line item sales with rep, product, quantity, unit price, and date selection.",
  "frontend/src/pages/SettlementPeriodsPage.tsx": "React page component for managing settlement periods with create/close functionality, displaying periods in a table with status badges, and using dialog forms for creating new periods with start/end date validation.",
  "frontend/src/pages/StatementsPage.tsx": "React page component for generating printable monthly statements per rep, allowing selection of rep/year/month and displaying sales, returns, payouts with commission calculations and balance summaries.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color system using OKLCH, typography, container settings, border radius variables, animations, and plugins for the ConsignFlow UI theme.",
  "project_state.json": "Project metadata tracking ConsignFlow's architecture, features, and roadmap including core consignment management, settlement periods, onboarding, identity-based analytics, and UI personalization features across versions 1 and 2."
}