{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Settlement Periods UI, Adjustments, Statement Period Selection, and Frontend Locking",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Add Settlement Periods management UI to create, view, and close periods and navigate to linked statements.",
      "acceptanceCriteria": [
        "App navigation includes a new entry \"Settlement Periods\" that routes to a new page.",
        "Settlement Periods page shows a list of periods with start date, end date, and status (Open/Closed).",
        "User can create a new open period by selecting startDate and endDate; the UI validates obvious issues (missing dates, end before start) before calling the backend.",
        "User can close an open period via an explicit confirmation step; after success, the period displays as Closed.",
        "For a selected period, UI shows the linked statement references and provides a way to open the corresponding statement view for a rep/period.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SettlementPeriodsPage.tsx",
          "operation": "create",
          "description": "Create a Settlement Periods management page using shadcn-ui components (Card, Table, Dialog/AlertDialog, Button, Input/Label) to list periods (start/end/status), create a new period with basic date validation, and close a period with explicit confirmation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for settlement periods (list, create, close, get by id as needed) using existing React Query patterns; ensure queries are invalidated after create/close so the list refreshes."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new Settlement Periods page into TanStack Router by adding a new route (e.g., /settlement-periods) and include it in the route tree."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a \"Settlement Periods\" navigation item to the existing top nav so users can reach the new route; use existing nav styling and icon pattern."
        },
        {
          "path": "frontend/src/pages/StatementsPage.tsx",
          "operation": "modify",
          "description": "Add support for navigating into Statements from a settlement period context (e.g., via search params/state) so the Settlement Periods page can deep-link the user to the correct statement generation/view."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Update statements UI to support settlement-period selection, show opening/closing balances for the period, and link generated statements to periods.",
      "acceptanceCriteria": [
        "Statements UI can be generated for a settlement period date range (startDate–endDate) and a selected rep.",
        "Statement view displays opening balance and closing balance for the selected settlement period using backend-provided values.",
        "When a statement is generated/printed for a rep + settlement period, the app stores a statement reference/link on the backend and shows it under that settlement period later.",
        "Existing monthly statement flow remains functional (at minimum) until settlement-period statements fully cover the same use case."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StatementsPage.tsx",
          "operation": "modify",
          "description": "Extend the Statements page UI to support a second generation mode for Settlement Period statements (in addition to existing monthly flow): allow selecting a settlement period and rep; compute the date range from the selected period; display opening and closing balances from backend-provided settlement period balances; keep the monthly statement flow functional. Use shadcn-ui components for selects/tables/cards as already used on the page. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add queries/mutations needed by Statements to load settlement periods (including per-rep opening/closing balances) and to call the backend capability that persists a statement reference/link for a given rep + settlement period after the user generates/prints."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update frontend backend type declarations to include any newly-added backend functions required for settlement-period statement linking and retrieving settlement-period balance/link data needed by the Statements UI."
        },
        {
          "path": "frontend/src/pages/SettlementPeriodsPage.tsx",
          "operation": "modify",
          "description": "Show statement references/links for each settlement period and provide navigation into the Statements page for the chosen period (and rep where applicable). Use shadcn-ui components (Table, Button, Select) for consistent UI. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Enforce settlement locking rules in the UI for consignments, sales, returns, and payouts, with a clear path to create an Adjustment.",
      "acceptanceCriteria": [
        "Create flows for consignments, sales, returns, and payouts prevent submission when the chosen date falls within a closed settlement period (UI disables submit or shows validation error).",
        "If the backend rejects due to a closed period, the UI displays a clear English error message and does not silently fail.",
        "UI provides a clear next step to record an adjustment (e.g., link/button to the Adjustments page or open an adjustment dialog) when an operation is blocked due to a closed period.",
        "No changes are made to any frontend immutablePaths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/settlementLock.ts",
          "operation": "create",
          "description": "Add a small utility to determine whether a given date falls within any closed settlement period, and to produce a deterministic English explanation message for the UI; this will be reused across create flows."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a query hook to load closed settlement periods (or all periods with filtering) so create flows can validate lock status client-side using React Query patterns."
        },
        {
          "path": "frontend/src/pages/ConsignmentsPage.tsx",
          "operation": "modify",
          "description": "Before submit, validate the chosen date against closed settlement periods; if locked, block submission (disable submit and/or show inline/toast error) and provide a clear next step to record an adjustment (link/button to the Adjustments page). Use existing shadcn-ui form components and Sonner toasts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SalesPage.tsx",
          "operation": "modify",
          "description": "Before submit, validate the chosen date against closed settlement periods; if locked, block submission and provide a clear next step to record an adjustment (link/button to the Adjustments page). Also surface clear English errors if the backend rejects due to locking. Use existing shadcn-ui components and Sonner toasts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ReturnsPage.tsx",
          "operation": "modify",
          "description": "Before submit, validate the chosen date against closed settlement periods; if locked, block submission and provide a clear next step to record an adjustment (link/button to the Adjustments page). Also handle backend lock rejections with clear English error text. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PayoutsPage.tsx",
          "operation": "modify",
          "description": "Before submit, validate the chosen date against closed settlement periods; if locked, block submission and provide a clear next step to record an adjustment (link/button to the Adjustments page). Also handle backend lock rejections with clear English error text. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the Adjustments route exists so lock messages can reliably direct users to the adjustment workflow."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add an Adjustments UI for recording and listing adjustments, including adjustments dated within closed settlement periods.",
      "acceptanceCriteria": [
        "App includes an Adjustments page (or equivalent UI) that lists adjustments with key fields (date, rep if applicable, type, amount/qty, reason/note).",
        "User can create a new adjustment with a date picker and required fields consistent with the backend Adjustment type.",
        "Creating an adjustment with a date inside a closed settlement period succeeds and appears in lists and downstream calculations/statement totals for that period (as applicable).",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdjustmentsPage.tsx",
          "operation": "create",
          "description": "Create an Adjustments page using shadcn-ui components (Card, Table, Dialog, Button, Input/Label, Select/Textarea as needed) to list adjustments and create a new adjustment (rep, date, amount, notes). Ensure the UI allows dates inside closed settlement periods. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks to list adjustments and create adjustments; invalidate adjustment lists on create and ensure any related settlement-period/statement queries are invalidated as appropriate."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new Adjustments page into TanStack Router by adding a new route (e.g., /adjustments) and include it in the route tree."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Add an \"Adjustments\" navigation entry in the top nav so users can access the adjustments workflow; follow existing nav patterns."
        }
      ]
    }
  ]
}